rolandvs/micropython/ports/stm32/boards/MACH_ELT2/mpconfigboard.h
/**
 *	ELT2 board uses little real estate so most of the options are DISABLED
 * 
**/


#define MICROPY_HW_BOARD_NAME       "MACH_ELT2"
#define MICROPY_HW_MCU_NAME         "STM32H743"

#define MICROPY_HW_ENABLE_RTC       (1)	// internal clock, no external 32768Hz XTAL
#define MICROPY_HW_ENABLE_RNG       (1)
#define MICROPY_HW_ENABLE_ADC       (0)
#define MICROPY_HW_ENABLE_DAC       (0)	// not used, could be a valuable debug tool
#define MICROPY_HW_ENABLE_USB       (0)	// not used, could be handy for debug
#define MICROPY_HW_ENABLE_SDCARD    (0)	// flash, no SD card
#define MICROPY_HW_HAS_SWITCH       (1)	// push button
#define MICROPY_HW_HAS_FLASH        (1)	// flash memory as file system

#define MICROPY_BOARD_EARLY_INIT    MACH_ELT2_board_early_init	// pre-init like reset peripherals
void MACH_ELT2_board_early_init(void);

// The board has an 25MHz HSE, the following gives CPU speed
#define MICROPY_HW_CLK_PLLM         (5)
#define MICROPY_HW_CLK_PLLN         (192)
#define MICROPY_HW_CLK_PLLP         (2)
#define MICROPY_HW_CLK_PLLQ         (15)
#define MICROPY_HW_CLK_PLLR         (2)
#define MICROPY_HW_CLK_PLLVCI       (RCC_PLL1VCIRANGE_3)
#define MICROPY_HW_CLK_PLLVCO       (RCC_PLL1VCOWIDE)
#define MICROPY_HW_CLK_PLLFRAC      (0)

// The USB clock is set using PLL3
#define MICROPY_HW_CLK_PLL3M        (5)
#define MICROPY_HW_CLK_PLL3N        (48)
#define MICROPY_HW_CLK_PLL3P        (2)
#define MICROPY_HW_CLK_PLL3Q        (5)
#define MICROPY_HW_CLK_PLL3R        (2)
#define MICROPY_HW_CLK_PLL3VCI      (RCC_PLL3VCIRANGE_2)
#define MICROPY_HW_CLK_PLL3VCO      (RCC_PLL3VCOWIDE)
#define MICROPY_HW_CLK_PLL3FRAC     (0)

// 4 wait states
#define MICROPY_HW_FLASH_LATENCY    FLASH_LATENCY_4

// UART config
#define MICROPY_HW_UART1_TX         (pin_B14)	// only one uart is used
#define MICROPY_HW_UART1_RX         (pin_B15)

//#define MICROPY_HW_UART1_TX         (pin_B6)
//#define MICROPY_HW_UART1_RX         (pin_B15)
//#define MICROPY_HW_UART2_TX         (pin_D5)
//#define MICROPY_HW_UART2_RX         (pin_D6)
//#define MICROPY_HW_UART2_RTS        (pin_D4)
//#define MICROPY_HW_UART2_CTS        (pin_D3)
//#define MICROPY_HW_UART3_TX         (pin_D8)
//#define MICROPY_HW_UART3_RX         (pin_D9)
//#define MICROPY_HW_UART5_TX         (pin_B6)
//#define MICROPY_HW_UART5_RX         (pin_B12)
//#define MICROPY_HW_UART6_TX         (pin_C6)
//#define MICROPY_HW_UART6_RX         (pin_C7)
//#define MICROPY_HW_UART7_TX         (pin_F7)
//#define MICROPY_HW_UART7_RX         (pin_F6)
//#define MICROPY_HW_UART8_TX         (pin_E1)
//#define MICROPY_HW_UART8_RX         (pin_E0)

#define MICROPY_HW_UART_REPL        PYB_UART_1	// repl console
#define MICROPY_HW_UART_REPL_BAUD   115200


// LEDs
#define MICROPY_HW_LED1             (pin_B7)    // red
#define MICROPY_HW_LED2             (pin_B8)	// green
#define MICROPY_HW_LED3             (pin_B9)	// blue
#define MICROPY_HW_LED_ON(pin)      (mp_hal_pin_low(pin))
#define MICROPY_HW_LED_OFF(pin)     (mp_hal_pin_high(pin))


// I2C buses
//#define MICROPY_HW_I2C1_SCL         (pin_B8)
//#define MICROPY_HW_I2C1_SDA         (pin_B9)
//#define MICROPY_HW_I2C2_SCL         (pin_F1)
//#define MICROPY_HW_I2C2_SDA         (pin_F0)
//#define MICROPY_HW_I2C4_SCL         (pin_F14)
//#define MICROPY_HW_I2C4_SDA         (pin_F15)

// SPI buses
//#define MICROPY_HW_SPI3_NSS         (pin_A4)
//#define MICROPY_HW_SPI3_SCK         (pin_B3)
//#define MICROPY_HW_SPI3_MISO        (pin_B4)
//#define MICROPY_HW_SPI3_MOSI        (pin_B5)

// USRSW is pulled high. Pressing the button makes the input go low.
#define MICROPY_HW_USRSW_PIN        (pin_E14)
#define MICROPY_HW_USRSW_PULL       (GPIO_PULLUP)
#define MICROPY_HW_USRSW_EXTI_MODE  (GPIO_MODE_IT_FALLING)
#define MICROPY_HW_USRSW_PRESSED    (0)


// USB config
#define MICROPY_HW_USB_FS              (1)
#define MICROPY_HW_USB_VBUS_DETECT_PIN (pin_A9)
#define MICROPY_HW_USB_OTG_ID_PIN      (pin_A10)

// FDCAN bus
//#define MICROPY_HW_CAN1_NAME  "FDCAN1"
//#define MICROPY_HW_CAN1_TX    (pin_D1)
//#define MICROPY_HW_CAN1_RX    (pin_D0)

// SD card detect switch
//#define MICROPY_HW_SDCARD_DETECT_PIN        (pin_G2)
//#define MICROPY_HW_SDCARD_DETECT_PULL       (GPIO_PULLUP)
//#define MICROPY_HW_SDCARD_DETECT_PRESENT    (GPIO_PIN_RESET)

// Ethernet via RMII (XTAL=25MHz)
#define MICROPY_HW_ETH_MDC          (pin_C1)
#define MICROPY_HW_ETH_MDIO         (pin_A2)
#define MICROPY_HW_ETH_RMII_REF_CLK (pin_A1)
#define MICROPY_HW_ETH_RMII_CRS_DV  (pin_A7)
#define MICROPY_HW_ETH_RMII_TX_EN   (pin_B11)
#define MICROPY_HW_ETH_RMII_TXD0    (pin_B12)
#define MICROPY_HW_ETH_RMII_TXD1    (pin_B13)
#define MICROPY_HW_ETH_RMII_RXD0    (pin_C4)
#define MICROPY_HW_ETH_RMII_RXD1    (pin_C5)
